<?php
	/*
		Напишите код, которой переделает структуру данных вот в такую:

		[
			'Россия'=> [
				'Москва', 'Питер', 'Владивосток',
			],
			'Беларусь'=> [
				'Минск', 'Могилев'
			],
			'Украина'=> [
				'Киев', 'Львов'
			],
		]
	*/
		$citys = [
		[
			'country' => 'Россия',
			'city' =>    'Москва',
		],
		[
			'country' => 'Беларусь',
			'city' =>    'Минск',
		],
		[
			'country' => 'Россия',
			'city' =>    'Питер',
		],
		[
			'country' => 'Россия',
			'city' =>    'Владивосток',
		],
		[
			'country' => 'Украина',
			'city' =>    'Львов',
		],
		[
			'country' => 'Беларусь',
			'city' =>    'Могилев',
		],
		[
			'country' => 'Украина',
			'city' =>    'Киев',
		],
	];
	$result = [];
	foreach($citys as $city){
		$result[$city['country']][] = $city['city'];
	
	}
	
	var_dump($result);