<?php
	//echo array_sum($_GET); //раскоментировать для вывода результата задачи 1
	
	//echo "Меня зовут $_POST[name], и мне $_POST[age] года."; //раскоментировать для вывода результата задачи 2
	
	//раскоментировать для вывода результата задачи 3
	/* 
		$pass = '12345';
		if($pass === $_POST['pass']){
			echo 'Пароль правильный';
		} else {
			echo 'Введите правильный пароль';
		}
	*/
	
	//раскоментировать для вывода результата задачи 4
	/*
	$days = [
			'Воскресенье', 'Понедельник', 'Вторник', 'Среда',
			'Четверг', 'Пятница', 'Суббота'
		];
	echo $days[date("w", strtotime($_POST['year']-$_POST['month']-$_POST['day']))];
	*/